{
  "categories": [
    {
      "id": "multiplayer-list",
      "name": "Multiplayer",
      "projects": [
        {
          "id": "battle-blasters",
          "name": "Battle Blasters",
          "status": "Ongoing",
          "thumbnail": "assets/Battle-Blasters_Cover.gif",
          "subtitle": "Multiplayer Shooter",
          "coverVideo": "assets/Battle-Blasters_FrontPage.webm",
          "about": [
            "Battle Blasters is a multiplayer shooter prototype built to implement and validate server-authoritative gameplay systems in Unreal Engine 5.",
            "The project focuses on real-time player replication, match state management, lag compensation, and gameplay validation under network latency.",
            "Core goal: design a multiplayer gameplay loop that remains synchronized and responsive across clients while preserving server authority."
          ],
          "projectInfo": {
            "timeFrame": "Ongoing",
            "engine": "Unreal Engine 5.2",
            "genre": "Multiplayer Shooter",
            "gameMode": "Deathmatch, Capture the Flag",
            "platform": "Windows (PC)"
          },
          "coreSystems": [
            {
              "title": "Replication",
              "description": "Design and implemented replicated player movement, firing logic, and gameplay state variables using Unreal's networking framework. Separated client input from server validation to maintain authoritative control over gameplay actions"            },
            {
              "title": "Match Flow",
              "description": "Implemented match state transitions including lobby, warmup, match start, and match end using GameMode and GameState ownership rules. Ensured consistent state synchronization across all connected cients."
            },
            {
              "title": "Lag Compensation",
              "description": "Implemented client-side prediction with server authority validation and reconciliation to minimize perceived latency during movement and firing."
            },
            {
              "title": "Weapon Synchronization",
              "description": "Server validated hit detection and damage application before replicating results to clients. Prevented client-authoritativedamage events to maintain gameplay integrity"
            },
            {
              "title": "Online Sessions",
              "description": "Integrated Unreal Online Subsystem (Steam) to handle session creation, joining, and matchmaking flow."
            }
          ],
          "technicalChallenges": [
            {
              "title": "Network Desync",
              "description": "Players experienced hit registration delay. Resolved using server validation and corrected timing of RPC calls."
            },
            {
              "title": "Latency",
              "description": "Implemented prediction and reconciliation to maintain smooth player movement under higher ping."
            },
            {
              "title": "Match Stability",
              "description": "Handled player disconnections and ensured match state remained consistent across clients."
            }
          ],
          "galleryImages": [
            "assets/Battle-Blasters_Second.gif",
            "assets/Battle-Blasters_Third.gif"
          ],
          "githubUrl": "https://github.com/Mecha-NOX/Battle-Blasters",
          "youtubeEmbed": "https://www.youtube.com/embed/tLNkaF6ZHlk?si=Zyjq8XHLG_-HEGTM",
          "systemsHeading": "Networking Systems"
        }
      ]
    },
    {
      "id": "ai-list",
      "name": "AI",
      "projects": [
        {
          "id": "echoes-of-the-lost-sands",
          "name": "Echoes of the Lost Sands",
          "status": "",
          "thumbnail": "assets/EchoesOfTheLostSands_Cover.gif",
          "subtitle": "Soulslike RPG",
          "coverVideo": "assets/EchoesOfTheLostSands_Large.webm",
          "about": [
            "Echoes of the Lost Sands is a third-person action RPG prototype built to implement animation-driven melee combat, enemy behavior, and boss state logic in Unreal Engine 5.",
            "The project focuses on responsive combat interactions, animation-based hit detection, boss encounters, and AI decision making. The primary goal was to create a combat loop where player input, animation timing, and enemy reactions remain tightly synchronized."
          ],
          "projectInfo": {
            "timeFrame": "3 months",
            "engine": "Unreal Engine 5.2",
            "genre": "RPG",
            "gameMode": "Single-player",
            "platform": "Windows (PC)"
          },
          "coreSystems": [
            {
              "title": "Melee Combat",
              "description": "Implemented a combo-based melee combat system using animation notifies and state-controlled attach chains. Player attacks trigger hit detection windows during animation frames, ensuring damage occurs only during valid contact timing. Handled damage application, hit reactions, and attack interruption logic."
            },
            {
              "title": "Enemy AI",
              "description": "Designed enemy bahevior using Behavior Trees and Blackboard keys. Enemies patrol when idle, detect the player using perception radius, chase and attack within range, disengage when distance exceeds threshold. Navigation mesh pathfinding controls movement and positioning during combat."
            },
            {
              "title": "Boss Logic",
              "description": "Implemented boss attack patterns using state-driven logic. Boss transitions between attack states, recovery windows, and idle phases, creating readable combat behavior rather than random attacks."
            },
            {
              "title": "Animation Integration",
              "description": "Used root motion animations and Motion Warping to align attacks with player positioning. Synchronized animation playback with gameplay logic to prevent sliding or mismatched hit registration."
            }
          ],
          "technicalChallenges": [
            {
              "title": "Hit Detection",
              "description": "Attack hits triggered incorrectly. Fixed using animation notify timing."
            },
            {
              "title": "AI Aggro",
              "description": "Enemies attacked too early. Balanced detection radius and attack distance."
            }
          ],
          "galleryImages": [
            "assets/EchoesOfTheLostSands_Second.gif",
            "assets/EchoesOfTheLostSands_Third.gif"
          ],
          "githubUrl": "https://github.com/Mecha-NOX/Echoes-of-the-Lost-Sands",
          "youtubeEmbed": "https://www.youtube.com/embed/lVcxVkBG1_8?si=zIZO_4piMP4zqY2U",
          "systemsHeading": "Core Systems Implemented"
        },
        {
          "id": "apex-ruin",
          "name": "Apex Ruin",
          "status": "",
          "thumbnail": "assets/Apex-Ruin_Cover.gif",
          "subtitle": "Third-Person Shooter",
          "coverVideo": "assets/Apex-Ruin_Large.webm",
          "about": [
            "Apex Ruin is a third-person shooter prototype built to implement modular combat systems, enemy AI behavior, and animation-driven aiming in Unreal Engine 4.",
            "The project focuses on integrating C++ gameplay logic with Blueprint systems to create a responsive combat loop combining weapon mechanics, AI engagement, and player feedback."
          ],
          "projectInfo": {
            "timeFrame": "3 months",
            "engine": "Unreal Engine 4.26",
            "genre": "Third-Person Shooter",
            "gameMode": "Single-player",
            "platform": "Windows (PC)"
          },
          "coreSystems": [
            {
              "title": "Combat System",
              "description": "Implemented a modular hitscan weapon system using C++ for firing logic and Blueprint for visual feedback. Weapon systems includes fire rate control and reload logic, recoil handling and camera feedback, hit detection and damage application, configurable wepon properties for different weapon types. Seperated input handling from weapon execution logic to maintain clean system ownership."
            },
            {
              "title": "Enemy AI",
              "description": "Designed enemy behavior using Behavior Trees and Blackboard keys. Enemies patrol predefined routes, detect the player using perception logic, hase within navigation mesh constraint, attack based on distance and cooldown timers. AI attack behavior integrates with animation states to prevent premature damage triggering."
            },
            {
              "title": "Animation System",
              "description": "Integrated Animation Blueprints, Blendspaces, Aim Offsets, and Inverse Kinematics to synchronize aiming direction with camera orientation. Resolved mismatched aim direction by aligning controller rotation with animation blending."
            },
            {
              "title": "HUD & Feedback",
              "description": "Implemented dynamic crosshair expansion based on firing state and movement speed. Integrated hit reaction feedback and health UI to communicate successful damage events."
            },
            {
              "title": "Inventory and Weapons",
              "description": "Built a weapon switching and inventory system supporting multiple weapon types. Weapons exist as configurable actors with shared base class logic to allow reuse and extension."
            }
          ],
          "technicalChallenges": [
            {
              "title": "AI Tuning",
              "description": "Enemies initially over-aggressively chased the player. Adjusted perception radius and attack cooldown logic to create balanced combat."
            },
            {
              "title": "Animation Synchronization",
              "description": "Faced issues with aim direction mismatching camera orientation. Resolved using Aim Offset blending and controller rotation alignment."
            },
            {
              "title": "Performance",
              "description": "Particle and material effects reduced performance during combat. Optimized update frequency and reduced dynamic material updates."
            }
          ],
          "galleryImages": [
            "assets/Apex-Ruin_Second.gif",
            "assets/Apex-Ruin_Third.gif"
          ],
          "githubUrl": "https://github.com/Mecha-NOX/Apex-Ruin",
          "youtubeEmbed": "https://www.youtube.com/embed/0dnEvv-QNS8?si=cR5NfQR7Np3qZIyC",
          "systemsHeading": "Core Systems Implemented"
        },
        {
          "id": "crimson-reign",
          "name": "Crimson Reign",
          "status": "",
          "thumbnail": "assets/Crimson-Reign.gif",
          "subtitle": "Hack-and-Slash",
          "coverVideo": "assets/Crimson-Reign_Large.webm",
          "about": [
            "Crimson Reign is a third-person melee combat prototype developed in Unreal Engine 4 using C++.",
            "This was my first complete gameplay systems project, where I implemented reusable gameplay classes, enemy AI logic, and player combat systems usng Unreal's gameplay framework. The focus was on understanding system ownership, combat flow, and AI state behavior."
          ],
          "projectInfo": {
            "timeFrame": "2 months",
            "engine": "Unreal Engine 4.25",
            "genre": "Hack-and-Slash",
            "gameMode": "Single-player",
            "platform": "Windows (PC)"
          },
          "coreSystems": [
            {
              "title": "Melee Combat System",
              "description": "Implemented player attack handling using animation-driven hit detection and state based attack execution. Combat includes attack input handling, damage calculation and application"
            },
            {
              "title": "Enemy AI Behavior",
              "description": "Created patrol, chase, and attack behaviors using Behavior Trees, Blackboard, and navigation meshes."
            },
            {
              "title": "Player Health and Damage",
              "description": "Built a modular health system, supporting damage calculation, death handling, and combat feedback."
            },
            {
              "title": "Interactive Environment",
              "description": "Programmed triggers, moving platforms, and timed interactions using C++ gameplay actors."
            },
            {
              "title": "HUD and Player Feedback",
              "description": "Implemented player UI elements including health bars and combat indicators integrated with gameplay events."
            }
          ],
          "technicalChallenges": [
            {
              "title": "AI Pathfinding",
              "description": "Integrating effective enemy pathfinding with navigation meshes and ensuring smooth navigation during combat and exploration."
            },
            {
              "title": "Combat Feedback",
              "description": "Balancing combat feedback (e.g., hit reactions, damage indicators) to ensure a satisfying player experience."
            },
            {
              "title": "Debugging & Optimization",
              "description": "Used logging and sphere drawing for debugging gameplay features like AI pathfinding and damage systems to ensure correct behavior during testing."
            }
          ],
          "galleryImages": [
            "assets/Crimson-Reign_Second.gif",
            "assets/Crimson-Reign_Third.gif"
          ],
          "githubUrl": "https://github.com/Mecha-NOX/Crimson-Reign",
          "youtubeEmbed": "https://www.youtube.com/embed/D1x6mGoV0V0?si=TMk8ckTKqgUpOHCU",
          "systemsHeading": "Core Systems Implemented"
        }
      ]
    },
    {
      "id": "blueprint-list",
      "name": "Blueprint",
      "projects": [
        {
          "id": "countdown-carnage",
          "name": "Countdown Carnage",
          "status": "",
          "thumbnail": "assets/Countdown-Carnage_Cover.gif",
          "subtitle": "First-Person Shooter",
          "coverVideo": "assets/Countdown-Carnage_Large.webm",
          "about": [
            "Countdown Carnage is a single-player FPS prototype developed to practice rapid gameplay loop design and Blueprint-based systems in Unreal Engine 5.",
            "The project focuses on enemy spawning, timed gameplay mechanics, and responsive player feedback systems."
          ],
          "projectInfo": {
            "timeFrame": "3 weeks",
            "engine": "Unreal Engine 5.3",
            "genre": "First-Person Shooter (FPS)",
            "gameMode": "Single-player",
            "platform": "Windows (PC)"
          },
          "coreSystems": [
            {
              "title": "Enemy Behavior",
              "description": "AI drones detect, chase, and attack the player using Blueprint logic and navigation meshes."
            },
            {
              "title": "Timer Gameplay",
              "description": "Implemented dynamic countdown systems that reward time bonuses for enemy eliminations."
            },
            {
              "title": "Pickups",
              "description": "Health and ammo pickups spawn and update player state variables."
            },
            {
              "title": "HUD",
              "description": "Created functional UI displaying player health, timer, and score."
            }
          ],
          "technicalChallenges": [
            {
              "title": "AI Navigation",
              "description": "Drones collided with level geometry. Fixed using improved navigation mesh setup."
            },
            {
              "title": "Timer Accuracy",
              "description": "Timer desynced during heavy combat events. Solved by moving timer logic to centralized controller."
            }
          ],
          "galleryImages": [],
          "githubUrl": "https://github.com/Mecha-NOX/Countdown-Carnage",
          "youtubeEmbed": "https://www.youtube.com/embed/ouyf6i2yRZs?si=3sHCd6igFaClT_8i",
          "systemsHeading": "Core Systems Implemented"
        }
      ]
    },
    {
      "id": "cpp-list",
      "name": "2D Games",
      "projects": [
        {
          "id": "retro-games-collection",
          "name": "Retro Games Collection",
          "status": "",
          "thumbnail": "assets/Dapper-Dasher.gif",
          "subtitle": "Retro Games Collection",
          "coverImage": "assets/Dapper-Dasher_HighRes.gif",
          "about": [
            "Retro Games Collection is a set of classic arcade games recreated in C++ using the Raylib library to practice low-level gameplay programming and collision systems."
          ],
          "projectInfo": {
            "timeFrame": "2 weeks",
            "engine": "Raylib",
            "genre": "Arcade",
            "gameMode": "Single Player",
            "platform": "Windows (PC)"
          },
          "games": [
            {
              "name": "Snake",
              "image": "./assets/Retro-Snake_HighRes.gif",
              "description": "Navigate a snake to collect food while avoiding collisions. Each collected item increases the snake's length, adding a layer of strategy and challenge.",
              "githubUrl": "https://github.com/Mecha-NOX/Retro-Snake"
            },
            {
              "name": "Tetris",
              "image": "./assets/Retro-Tetris_HighRes.gif",
              "description": "Arrange falling blocks into complete rows to clear them and earn points. Increasing speeds add a thrilling challenge as players progress.",
              "githubUrl": "https://github.com/Mecha-NOX/Retro-Tetris"
            },
            {
              "name": "Space Invaders",
              "image": "./assets/Space-Invaders_HighRes.gif",
              "description": "Defend against waves of alien invaders in this classic arcade shooter. Aim, shoot, and survive as enemies accelerate over time.",
              "githubUrl": "https://github.com/Mecha-NOX/Retro-Space-Invaders"
            },
            {
              "name": "Ping Pong",
              "image": "./assets/Ping-Pong_HighRes.gif",
              "description": "A dynamic two-player game where players control paddles to bounce the ball and score by getting it past their opponent.",
              "githubUrl": "https://github.com/Mecha-NOX/Retro-Ping-Pong"
            },
            {
              "name": "Dapper Dasher",
              "image": "./assets/Dapper-Dasher_HighRes.gif",
              "description": "A fast-paced platformer where players dodge obstacles and collect rewards while navigating challenging levels.",
              "githubUrl": "https://github.com/Mecha-NOX/Dapper-Dasher"
            }
          ],
          "coreSystems": [
            {
              "title": "Collision Detection",
              "description": "Handled player-object and object-object collisions manually using bounding boxes."
            },
            {
              "title": "Game States",
              "description": "Implemented menu, gameplay, and game-over states."
            },
            {
              "title": "Input Handling",
              "description": "Processed keyboard input for player movement and actions."
            }
          ],
          "technicalChallenges": [
            {
              "title": "Animating 2D Characters",
              "description": "Faced challenges in implementing smooth animations, which were resolved by utilizing Raylib's animation capabilities effectively."
            },
            {
              "title": "Debugging Complex Interactions",
              "description": "Resolved gameplay bugs using systematic debugging techniques, such as tracing logic flows and testing individual modules."
            }
          ],
          "galleryImages": [],
          "githubUrl": "",
          "youtubeEmbed": "",
          "systemsHeading": "Core Systems Implemented"
        }
      ]
    }
  ]
}
